Revit 2027 API
ParameterTypeId.FloorParamSpanDirection Property
 "Span Direction"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FloorParamSpanDirection { get; }
Public Shared ReadOnly Property FloorParamSpanDirection As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FloorParamSpanDirection {
	ForgeTypeId^ get ();
}
static member FloorParamSpanDirection : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace